ErichStyger/mcuoneclipse/Examples/MCUXpresso/FRDM-MCXN236/MCXN236_Blinky/component/uart/fsl_adapter_lpuart.c
#if defined(LPUART10)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART10_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(10);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART10_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(10);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM10)
void LP_FLEXCOMM10_IRQHandler(void);
void LP_FLEXCOMM10_IRQHandler(void)
#else /* LP_FLEXCOMM10 */
void LPUART10_IRQHandler(void);
void LPUART10_IRQHandler(void)
#endif /* LP_FLEXCOMM10 */
{
    HAL_UartInterruptHandle(10);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART10 */

#if defined(LPUART11)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART11_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(11);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART11_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(11);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM11)
void LP_FLEXCOMM11_IRQHandler(void);
void LP_FLEXCOMM11_IRQHandler(void)
#else /* LP_FLEXCOMM11 */
void LPUART11_IRQHandler(void);
void LPUART11_IRQHandler(void)
#endif /* LP_FLEXCOMM11 */
{
    HAL_UartInterruptHandle(11);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART11 */

#if defined(LPUART12)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART12_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(12);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART12_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(12);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM12)
void LP_FLEXCOMM12_IRQHandler(void);
void LP_FLEXCOMM12_IRQHandler(void)
#else /* LP_FLEXCOMM12 */
void LPUART12_IRQHandler(void);
void LPUART12_IRQHandler(void)
#endif /* LP_FLEXCOMM12 */
{
    HAL_UartInterruptHandle(12);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART12 */

#if defined(LPUART13)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART13_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(13);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART13_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(13);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM13)
void LP_FLEXCOMM13_IRQHandler(void);
void LP_FLEXCOMM13_IRQHandler(void)
#else /* LP_FLEXCOMM13 */
void LPUART13_IRQHandler(void);
void LPUART13_IRQHandler(void)
#endif /* LP_FLEXCOMM13 */
{
    HAL_UartInterruptHandle(13);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART13 */

#if defined(LPUART17)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART17_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(17);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART17_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(17);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM17)
void LP_FLEXCOMM17_IRQHandler(void);
void LP_FLEXCOMM17_IRQHandler(void)
#else /* LP_FLEXCOMM17 */
void LPUART17_IRQHandler(void);
void LPUART17_IRQHandler(void)
#endif /* LP_FLEXCOMM17 */
{
    HAL_UartInterruptHandle(17);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART17 */

#if defined(LPUART18)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART18_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(18);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART18_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(18);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM18)
void LP_FLEXCOMM18_IRQHandler(void);
void LP_FLEXCOMM18_IRQHandler(void)
#else /* LP_FLEXCOMM18 */
void LPUART18_IRQHandler(void);
void LPUART18_IRQHandler(void)
#endif /* LP_FLEXCOMM18 */
{
    HAL_UartInterruptHandle(18);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART18 */

#if defined(LPUART19)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART19_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(19);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART19_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(19);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM19)
void LP_FLEXCOMM19_IRQHandler(void);
void LP_FLEXCOMM19_IRQHandler(void)
#else /* LP_FLEXCOMM19 */
void LPUART19_IRQHandler(void);
void LPUART19_IRQHandler(void)
#endif /* LP_FLEXCOMM19 */
{
    HAL_UartInterruptHandle(19);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART19 */

#if defined(LPUART20)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART20_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(20);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART20_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(20);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM20)
void LP_FLEXCOMM20_IRQHandler(void);
void LP_FLEXCOMM20_IRQHandler(void)
#else /* LP_FLEXCOMM20 */
void LPUART20_IRQHandler(void);
void LPUART20_IRQHandler(void)
#endif /* LP_FLEXCOMM20 */
{
    HAL_UartInterruptHandle(20);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART20 */

#if defined(CM4_0__LPUART)
void M4_0_LPUART_IRQHandler(void);
void M4_0_LPUART_IRQHandler(void)
{
    HAL_UartInterruptHandle(LPUART_GetInstance(CM4_0__LPUART));
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(CM4_1__LPUART)
void M4_1_LPUART_IRQHandler(void);
void M4_1_LPUART_IRQHandler(void)
{
    HAL_UartInterruptHandle(LPUART_GetInstance(CM4_1__LPUART));
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(CM4__LPUART)
void M4_LPUART_IRQHandler(void);
void M4_LPUART_IRQHandler(void)
{
    HAL_UartInterruptHandle((uint8_t)LPUART_GetInstance(CM4__LPUART));
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(DMA__LPUART0)
void DMA_UART0_INT_IRQHandler(void)
{
    HAL_UartInterruptHandle(LPUART_GetInstance(DMA__LPUART0));
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(DMA__LPUART1)
void DMA_UART1_INT_IRQHandler(void)
{
    HAL_UartInterruptHandle(LPUART_GetInstance(DMA__LPUART1));
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(DMA__LPUART2)
void DMA_UART2_INT_IRQHandler(void)
{
    HAL_UartInterruptHandle(LPUART_GetInstance(DMA__LPUART2));
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(DMA__LPUART3)
void DMA_UART3_INT_IRQHandler(void)
{
    HAL_UartInterruptHandle(LPUART_GetInstance(DMA__LPUART3));
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(DMA__LPUART4)
void DMA_UART4_INT_IRQHandler(void)
{
    HAL_UartInterruptHandle(LPUART_GetInstance(DMA__LPUART4));
    SDK_ISR_EXIT_BARRIER;
}
#endif

